In [1]:
import pandas as pd
from pandas import Series,DataFrame  #Series一维数据以及一组与之相关的数据标签组成 DataFrame

In [2]:
obj = pd.Series([4,6,1,-4])
obj

0    4
1    6
2    1
3   -4
dtype: int64

In [3]:
obj.values

array([ 4,  6,  1, -4], dtype=int64)

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = pd.Series([4,7,2,-3],index=['d','b','a','c'])
obj2

d    4
b    7
a    2
c   -3
dtype: int64

In [6]:
obj2['a']

2

In [7]:
'a' in obj2

True

In [8]:
sdata = {'ohio':35000,'texas':71000,'oregon':16000}
obj3 = pd.Series(sdata)
obj3

ohio      35000
texas     71000
oregon    16000
dtype: int64

In [9]:
states = ['california','ohio','oregon','texas']
obj4 = pd.Series(sdata,index=states)
obj4

california        NaN
ohio          35000.0
oregon        16000.0
texas         71000.0
dtype: float64

In [10]:
pd.isnull(obj4)

california     True
ohio          False
oregon        False
texas         False
dtype: bool

In [11]:
pd.notnull(obj4)

california    False
ohio           True
oregon         True
texas          True
dtype: bool

In [12]:
obj3 + obj4

california         NaN
ohio           70000.0
oregon         32000.0
texas         142000.0
dtype: float64

In [13]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
california        NaN
ohio          35000.0
oregon        16000.0
texas         71000.0
Name: population, dtype: float64

### DataFrame

In [16]:
data = {'state':['ohio','ohio','ohio','nevada','nevada','nevada'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.2,1.3,1.5,4.3,5.3,6.3]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    ohio  2000  1.2
1    ohio  2001  1.3
2    ohio  2002  1.5
3  nevada  2001  4.3
4  nevada  2002  5.3
5  nevada  2003  6.3

In [17]:
frame.head()

    state  year  pop
0    ohio  2000  1.2
1    ohio  2001  1.3
2    ohio  2002  1.5
3  nevada  2001  4.3
4  nevada  2002  5.3

In [18]:
pd.DataFrame(data,columns = ['year','state','pop'])

   year   state  pop
0  2000    ohio  1.2
1  2001    ohio  1.3
2  2002    ohio  1.5
3  2001  nevada  4.3
4  2002  nevada  5.3
5  2003  nevada  6.3

In [19]:
frame['state'] #通过类似字典标记的方式或属性的方式，可以将DataFrame的列获取为一个

0      ohio
1      ohio
2      ohio
3    nevada
4    nevada
5    nevada
Name: state, dtype: object

In [20]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [21]:
frame2 = pd.DataFrame(data,columns=['year','state','pop','dabt'],index=['one','two','three','four','five','six'])
frame2

       year   state  pop dabt
one    2000    ohio  1.2  NaN
two    2001    ohio  1.3  NaN
three  2002    ohio  1.5  NaN
four   2001  nevada  4.3  NaN
five   2002  nevada  5.3  NaN
six    2003  nevada  6.3  NaN

In [22]:
frame2.loc['three'] # 获取行

year     2002
state    ohio
pop       1.5
dabt      NaN
Name: three, dtype: object

In [23]:
frame2['debt'] = 16.5
frame2

       year   state  pop dabt  debt
one    2000    ohio  1.2  NaN  16.5
two    2001    ohio  1.3  NaN  16.5
three  2002    ohio  1.5  NaN  16.5
four   2001  nevada  4.3  NaN  16.5
five   2002  nevada  5.3  NaN  16.5
six    2003  nevada  6.3  NaN  16.5

In [25]:
import numpy as np
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop dabt  debt
one    2000    ohio  1.2  NaN   0.0
two    2001    ohio  1.3  NaN   1.0
three  2002    ohio  1.5  NaN   2.0
four   2001  nevada  4.3  NaN   3.0
five   2002  nevada  5.3  NaN   4.0
six    2003  nevada  6.3  NaN   5.0

In [26]:
val = pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt'] = val        #将列表或数组赋值给某个列时，其长度必须跟DataFrame的长度相匹配。
                            #如果赋值的是一个Series，就会精确匹配DataFrame的索引，所有的空位都将被填上缺失值：
frame2

       year   state  pop dabt  debt
one    2000    ohio  1.2  NaN   NaN
two    2001    ohio  1.3  NaN  -1.2
three  2002    ohio  1.5  NaN   NaN
four   2001  nevada  4.3  NaN  -1.5
five   2002  nevada  5.3  NaN  -1.7
six    2003  nevada  6.3  NaN   NaN

In [27]:
frame2['easten'] = frame2.state == 'ohio'
frame2

       year   state  pop dabt  debt  easten
one    2000    ohio  1.2  NaN   NaN    True
two    2001    ohio  1.3  NaN  -1.2    True
three  2002    ohio  1.5  NaN   NaN    True
four   2001  nevada  4.3  NaN  -1.5   False
five   2002  nevada  5.3  NaN  -1.7   False
six    2003  nevada  6.3  NaN   NaN   False

In [28]:
del frame2['easten']
frame2.columns

Index(['year', 'state', 'pop', 'dabt', 'debt'], dtype='object')

### 索引对象

In [29]:
obj = pd.Series(range(3),index=['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [30]:
index[1:]

Index(['b', 'c'], dtype='object')

In [31]:
index[1]

'b'

In [32]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [33]:
obj2 = pd.Series([1.5,-2.5,0],index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

## 基本功能

### 重新索引

In [34]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [35]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [36]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [37]:
obj3.reindex(range(6),method = 'ffill')  #method选项即可达到此目的，例如，使用ffill可以实现前向值填充

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [38]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index = ['a','c','d'],
                     columns = ['okio','texas','california'])
frame

   okio  texas  california
a     0      1           2
c     3      4           5
d     6      7           8

In [39]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   okio  texas  california
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [40]:
states = ['texas','utha','california']
frame.reindex(columns=states)    #列可以用columns关键字重新索引

   texas  utha  california
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### 丢弃指定轴上的项

In [47]:
obj = pd.Series(np.arange(5.),index=['a','b','c','d','e'])  #5. 小数点后一位
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [48]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [49]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [50]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                     index = ['ohio','colorado','utah','new york'],
                     columns = ['one','two','three','four'])
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [51]:
data.drop(['colorado','ohio'])

          one  two  three  four
utah        8    9     10    11
new york   12   13     14    15

In [52]:
data.drop('two',axis=1)   #通过传递axis=1或axis='columns'可以删除列的值

          one  three  four
ohio        0      2     3
colorado    4      6     7
utah        8     10    11
new york   12     14    15

In [53]:
data.drop(['two','four'],axis='columns')

          one  three
ohio        0      2
colorado    4      6
utah        8     10
new york   12     14

In [54]:
obj.drop('c',inplace=True)   #小心使用inplace，它会销毁所有被删除的数据
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### 索引、选取 过滤

In [55]:
data

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7
utah        8    9     10    11
new york   12   13     14    15

In [56]:
data[:2]

          one  two  three  four
ohio        0    1      2     3
colorado    4    5      6     7

In [57]:
data.loc['colorado',['two','three']]  #使用轴标签（loc）或整数索引（iloc），从DataFrame选择行和列的子集

two      5
three    6
Name: colorado, dtype: int32

In [58]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: utah, dtype: int32

In [59]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: utah, dtype: int32

### 数据对齐 reshape

In [68]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                   columns = list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                   columns = list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [69]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [64]:
df2.loc[1,'b'] = np.nan  #1行b列用 NaN填充
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [65]:
df1 + df2   #将它们相加时，没有重叠的位置就会产生NAN值

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [66]:
df1.add(df2,fill_value=0)   #把 NAN值用0 代替

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

### 函数的应用和映射

In [70]:
f = lambda x:x.max() - x.min()

In [72]:
frame = pd.DataFrame(np.random.randn(4,3),
                     columns = list('bde'),
                     index = ['ohio','colorado','utah','new york'])
frame

                 b         d         e
ohio     -2.143778 -0.781758  0.440640
colorado -0.625870  0.881188  0.385714
utah      1.282224  0.514617 -0.025271
new york -0.393972 -0.641985  0.851494

In [73]:
np.abs(frame)

                 b         d         e
ohio      2.143778  0.781758  0.440640
colorado  0.625870  0.881188  0.385714
utah      1.282224  0.514617  0.025271
new york  0.393972  0.641985  0.851494

In [74]:
frame.apply(f)

b    3.426002
d    1.662945
e    0.876764
dtype: float64

In [75]:
frame.apply(f,axis='columns')

ohio        2.584418
colorado    1.507058
utah        1.307495
new york    1.493478
dtype: float64

### 排序和排名

In [76]:
obj = pd.Series(range(4),index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [77]:
df3 = pd.DataFrame(np.arange(8).reshape((2,4)),
                   index = ['three','one'],
                   columns = ['d','a','b','c'])
df3.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [78]:
df3.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [79]:
df3.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [80]:
obj = pd.Series([4,7,-3,2])
obj.sort_index()

0    4
1    7
2   -3
3    2
dtype: int64

In [81]:
#在排序时，任何缺失值默认都会被放到Series的末尾
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [82]:
#当排序一个DataFrame时，你可能希望根据一个或多个列中的值进行排序。将一个或多个列的名字传递给sort_values的by选项即可达到该目的
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [83]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [84]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [85]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [86]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [87]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0,1],'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [88]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [89]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [91]:
df.idxmax()

one    b
two    d
dtype: object

In [92]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [93]:
df.describe()  #非常常用

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

## 相关系数和协方差  .corr .cov开始分析数据

In [2]:
import pandas as pd
import pandas_datareader.data as web
all_data = {ticker:web.get_data_yahoo(ticker)
            for ticker in ['AAPL','IBM','MSFT','GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
            for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
            for ticker, data in all_data.items()})
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-02-25  0.007284  0.001508  0.005587 -0.000874
2019-02-26  0.000574  0.001864  0.006900  0.005165
2019-02-27  0.003098 -0.003936 -0.001691  0.000825
2019-02-28 -0.009836 -0.007473 -0.001248  0.003468
2019-03-01  0.010511  0.007746  0.004463  0.018814

In [3]:
returns['MSFT'].corr(returns['IBM'])  #corr方法用于计算两个Series中重叠的、非NA的、按索引对齐的值的相关系数

0.4866831097879075

In [4]:
returns['MSFT'].cov(returns['IBM'])   #cov用于计算协方差

8.734718905795014e-05